In [2]:
import numpy as np # linear algebra
import pandas as pd

In [4]:
 titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')

In [26]:
titanic_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [27]:
titanic_data.Fare.isnull().sum() #len(titanic_data) - titanic_data['Fare'].count()

0

In [34]:
titanic_data.Sex[titanic_data.Sex=='male'].count()

577

In [98]:
print(titanic_data.Sex[titanic_data.Sex=='female'].count())
print(titanic_data.Sex.value_counts())

314
male      577
female    314
Name: Sex, dtype: int64

In [53]:
titanic_data.SibSp.mode()

0    0
dtype: int64

In [99]:
titanic_data.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [56]:
titanic_data.Name[titanic_data.Survived==1].count()/titanic_data.Survived.count()

0.3838383838383838

In [57]:
titanic_data.Fare.median()

14.4542

In [68]:
titanic_data.Name[(titanic_data.Survived==1) & (titanic_data.Sex=='male')].count() / titanic_data.Name[titanic_data.Sex=='male'].count()*100

18.890814558058924

titanic_data.Name[(titanic_data.Survived==1) & (titanic_data.Sex=='female')].count() / titanic_data.Name[titanic_data.Sex=='female'].count()*100

In [71]:
titanic_data.Name[(titanic_data.Survived==1) & (titanic_data.Sex=='female')].count() / titanic_data.Name[titanic_data.Sex=='female'].count()*100

74.20382165605095

In [72]:
titanic_data.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [73]:
titanic_data.Name[(titanic_data.Survived==1) & (titanic_data.Pclass==1)].count() / titanic_data.Name[titanic_data.Pclass==1].count()*100

62.96296296296296

In [74]:
titanic_data.Name[(titanic_data.Survived==1) & (titanic_data.Pclass==2)].count() / titanic_data.Name[titanic_data.Pclass==2].count()*100

47.28260869565217

In [75]:
titanic_data.Name[(titanic_data.Survived==1) & (titanic_data.Pclass==3)].count() / titanic_data.Name[titanic_data.Pclass==3].count()*100

24.236252545824847

In [76]:
print('% of children who survived', 100*np.mean(titanic['Survived'][titanic['Age'] < 18]))
print('% of adults who survived', 100*np.mean(titanic['Survived'][titanic['Age'] > 18]))

% of children who survived 53.98230088495575
% of adults who survived 38.26086956521739

In [82]:
survived_passengers=titanic_data[titanic_data.Survived==1]

In [83]:
survived_passengers.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [85]:
survived_passengers.Embarked.value_counts()

S    217
C     93
Q     30
Name: Embarked, dtype: int64

In [86]:
titanic_data.nlargest(5, 'Fare')

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S

In [91]:
titanic_data.Age.median()

28.0

In [95]:
titanic_data.Name.value_counts().count()

891

In [96]:
titanic_data["Name"].nunique()

891